DocumentJournals/Взаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>Взаимодействия</Name>
			<RegisteredDocuments>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Автор</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.Автор</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Автор</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Автор</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Автор</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Автор</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Входящий</Name>
					<References>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Входящий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.Встреча.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Тема</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Тема</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Тема</xr:Item>
						<xr:Item>Document.Встреча.Attribute.Тема</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Тема</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Тема</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Тема</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Рассмотрено</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.Удалить_Рассмотрено</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Удалить_Рассмотрено</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Удалить_Рассмотрено</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Удалить_Рассмотрено</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Удалить_Рассмотрено</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Удалить_Рассмотрено</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.Удалить_РассмотретьПосле</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Удалить_РассмотретьПосле</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Удалить_РассмотретьПосле</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Удалить_РассмотретьПосле</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Удалить_РассмотретьПосле</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Удалить_РассмотретьПосле</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Участники</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.СписокУчастников</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.АбонентПредставление</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.СписокПолучателейПисьма</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.ОтправительПредставление</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.СписокУчастников</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.СписокУчастников</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтатусИсходящегоПисьма</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.СтатусПисьма</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Состояние</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.УчетнаяЗапись</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.УчетнаяЗапись</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЕстьВложения</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.ЕстьВложения</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.ЕстьВложения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.ВзаимодействиеОснование</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.ВзаимодействиеОснование</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.ВзаимодействиеОснование</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.ВзаимодействиеОснование</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.ВзаимодействиеОснование</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.ВзаимодействиеОснование</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПолученоОтправлено</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.ДатаПолучения</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.ДатаОтправления</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Размер</Name>
					<References>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Размер</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Размер</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Важность</Name>
					<References>
						<xr:Item>Document.Встреча.Attribute.Важность</xr:Item>
						<xr:Item>Document.ЗапланированноеВзаимодействие.Attribute.Важность</xr:Item>
						<xr:Item>Document.ТелефонныйЗвонок.Attribute.Важность</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоВходящее.Attribute.Важность</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.Важность</xr:Item>
						<xr:Item>Document.СообщениеSMS.Attribute.Важность</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаКогдаОтправить</Name>
					<References>
						<xr:Item>Document.СообщениеSMS.Attribute.ДатаКогдаОтправить</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.ДатаКогдаОтправить</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаАктуальностиОтправки</Name>
					<References>
						<xr:Item>Document.СообщениеSMS.Attribute.ДатаАктуальностиОтправки</xr:Item>
						<xr:Item>Document.ЭлектронноеПисьмоИсходящее.Attribute.ДатаАктуальностиОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Enums/СпособыРедактированияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>СпособыРедактированияЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбычныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DocumentJournals/Взаимодействия/Forms/НастройкиРаботыСПочтой/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОтправлятьПисьмаВФорматеHTML = ПолучитьФункциональнуюОпцию("ОтправлятьПисьмаВФорматеHTML");
	НастройкиХранилище = Взаимодействия.ПолучитьНастройкуРаботаСПочтой();
	
	ВключатьПодписьДляНовыхСообщений             = ?(НастройкиХранилище.Свойство("ВключатьПодписьДляНовыхСообщений"),
		НастройкиХранилище.ВключатьПодписьДляНовыхСообщений,Истина);
	ФорматПодписиДляНовыхСообщений               = ?(НастройкиХранилище.Свойство("ФорматПодписиДляНовыхСообщений") И ОтправлятьПисьмаВФорматеHTML,
		НастройкиХранилище.ФорматПодписиДляНовыхСообщений,
		Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст);
	ВключатьПодписьПриОтветеПересылке            = ?(НастройкиХранилище.Свойство("ВключатьПодписьПриОтветеПересылке"),
		НастройкиХранилище.ВключатьПодписьПриОтветеПересылке,Истина);
	ФорматПодписиПриОтветеПересылке              = ?(НастройкиХранилище.Свойство("ФорматПодписиПриОтветеПересылке") И ОтправлятьПисьмаВФорматеHTML,
		НастройкиХранилище.ФорматПодписиПриОтветеПересылке,
		Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст);
	ПорядокОтветовНаЗапросыУведомленийОПрочтении = ?(НастройкиХранилище.Свойство("ПорядокОтветовНаЗапросыУведомленийОПрочтении"),
		НастройкиХранилище.ПорядокОтветовНаЗапросыУведомленийОПрочтении,
		Перечисления.ПорядокОтветовНаЗапросыУведомленийОПрочтении.ЗапрашиватьПередТемКакОтправитьУведомление);
	ВсегдаЗапрашиватьУведомлениеОПрочтении       = ?(НастройкиХранилище.Свойство("ВсегдаЗапрашиватьУведомлениеОПрочтении"),
		НастройкиХранилище.ВсегдаЗапрашиватьУведомлениеОПрочтении,Ложь);
	ВсегдаЗапрашиватьУведомленияОДоставке        = ?(НастройкиХранилище.Свойство("ВсегдаЗапрашиватьУведомленияОДоставке"),
		НастройкиХранилище.ВсегдаЗапрашиватьУведомленияОДоставке,Ложь);
	НовоеСообщениеФорматированныйДокумент        = ?(НастройкиХранилище.Свойство("НовоеСообщениеФорматированныйДокумент"),
		НастройкиХранилище.НовоеСообщениеФорматированныйДокумент,Неопределено);
	ПодписьДляНовыхСообщенийПростойТекст         = ?(НастройкиХранилище.Свойство("ПодписьДляНовыхСообщенийПростойТекст"),
		НастройкиХранилище.ПодписьДляНовыхСообщенийПростойТекст,Неопределено);
	ПодписьПриОтветеПересылкеПростойТекст        = ?(НастройкиХранилище.Свойство("ПодписьПриОтветеПересылкеПростойТекст"),
		НастройкиХранилище.ПодписьПриОтветеПересылкеПростойТекст,Неопределено);
	ПриОтветеПересылкеФорматированныйДокумент    = ?(НастройкиХранилище.Свойство("ПриОтветеПересылкеФорматированныйДокумент"),
		НастройкиХранилище.ПриОтветеПересылкеФорматированныйДокумент,Неопределено);
	ОтображатьТелоИсходногоПисьма                = ?(НастройкиХранилище.Свойство("ОтображатьТелоИсходногоПисьма"),
		НастройкиХранилище.ОтображатьТелоИсходногоПисьма,Ложь);
	ВключатьТелоИсходногоПисьма                  = ?(НастройкиХранилище.Свойство("ВключатьТелоИсходногоПисьма"),
		НастройкиХранилище.ВключатьТелоИсходногоПисьма,Ложь);
	ОтправлятьСообщенияСразу                     = ?(НастройкиХранилище.Свойство("ОтправлятьСообщенияСразу"),
		НастройкиХранилище.ОтправлятьСообщенияСразу,Ложь);
		
	Элементы.ОтправлятьСообщенияСразу.Видимость = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Элементы.ПодписьПриОтвете.Картинка = ВзаимодействияКлиентСервер.ПолучитьКартинкуСтраницыПодписи(ВключатьПодписьПриОтветеПересылке);
	Элементы.ПодписьДляНового.Картинка = ВзаимодействияКлиентСервер.ПолучитьКартинкуСтраницыПодписи(ВключатьПодписьДляНовыхСообщений);
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВключатьПодписьДляНовыйСообщенийПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьПодписьПриОтветеПересылкеПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматПодписиДляНовыхСообщенийПриИзменении(Элемент)
	
	Если ФорматПодписиДляНовыхСообщений = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") 
			И Элементы.СтраницыПодписьДляНовыхСообщений.ТекущаяСтраница = Элементы.СтраницаНовоеСообщениеФорматированныйТекст Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ФорматПодписиДляНовыхСообщений = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст") 
			И Элементы.СтраницыПодписьДляНовыхСообщений.ТекущаяСтраница = Элементы.СтраницаНовоеСообщениеПростойТекст Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ФорматПодписиДляНовыхСообщений = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		
		Если Не ПустаяСтрока(ПодписьДляНовыхСообщенийПростойТекст) Тогда
			НовоеСообщениеФорматированныйДокумент.Удалить();
			НовоеСообщениеФорматированныйДокумент.Добавить(ПодписьДляНовыхСообщенийПростойТекст);
		КонецЕсли;
		
		УправлениеДоступностью(ЭтотОбъект);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("КонтекстВызова", "ДляНовыхСообщений");
		ВзаимодействияКлиент.ВопросПриИзмененииФорматаСообщенияНаОбычныйТекст(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматПодписиПриОтветеПересылкеПриИзменении(Элемент)
	
	Если ФорматПодписиПриОтветеПересылке = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") 
			И Элементы.СтраницыПодписьПриОтветеПересылке.ТекущаяСтраница = Элементы.СтраницаПриОтветеПересылкеФорматированныйДокумент Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ФорматПодписиПриОтветеПересылке =
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст") 
			И Элементы.СтраницыПодписьПриОтветеПересылке.ТекущаяСтраница = Элементы.СтраницаПриОтветеПересылкеПростойТекст Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ФорматПодписиПриОтветеПересылке = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		
		Если Не ПустаяСтрока(ПодписьПриОтветеПересылкеПростойТекст) Тогда
			ПриОтветеПересылкеФорматированныйДокумент.Удалить();
			ПриОтветеПересылкеФорматированныйДокумент.Добавить(ПодписьПриОтветеПересылкеПростойТекст);
		КонецЕсли;
		
		УправлениеДоступностью(ЭтотОбъект);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("КонтекстВызова", "ПриОтветеПересылке");
		ВзаимодействияКлиент.ВопросПриИзмененииФорматаСообщенияНаОбычныйТекст(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНастройки();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)

	Если Форма.ФорматПодписиДляНовыхСообщений = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		
		Форма.Элементы.СтраницыПодписьДляНовыхСообщений.ТекущаяСтраница = Форма.Элементы.СтраницаНовоеСообщениеФорматированныйТекст;
		Форма.Элементы.НовоеСообщениеФорматированныйДокумент.Доступность = Форма.ВключатьПодписьДляНовыхСообщений;
		
	Иначе
		
		Форма.Элементы.СтраницыПодписьДляНовыхСообщений.ТекущаяСтраница = Форма.Элементы.СтраницаНовоеСообщениеПростойТекст;
		Форма.Элементы.ПодписьДляНовыхСообщенийПростойТекст.Доступность = Форма.ВключатьПодписьДляНовыхСообщений;
		
	КонецЕсли;
	
	Если Форма.ФорматПодписиПриОтветеПересылке = 
			ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		
		Форма.Элементы.СтраницыПодписьПриОтветеПересылке.ТекущаяСтраница = 
			Форма.Элементы.СтраницаПриОтветеПересылкеФорматированныйДокумент;
		Форма.Элементы.ПриОтветеПересылкеФорматированныйДокумент.Доступность  = Форма.ВключатьПодписьПриОтветеПересылке;
		
	Иначе
		
		Форма.Элементы.СтраницыПодписьПриОтветеПересылке.ТекущаяСтраница = Форма.Элементы.СтраницаПриОтветеПересылкеПростойТекст;
		Форма.Элементы.ПодписьПриОтветеПересылкеПростойТекст.Доступность = Форма.ВключатьПодписьПриОтветеПересылке;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если ФорматПодписиДляНовыхСообщений <> Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		ПодписьДляНовыхСообщенийФорматированныйДокумент = Неопределено;
		
	Иначе
		
		ПодписьДляНовыхСообщенийПростойТекст = НовоеСообщениеФорматированныйДокумент.ПолучитьТекст();
		
	КонецЕсли;
	
	Если ФорматПодписиПриОтветеПересылке <> Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		ПодписьПриОтветеПересылкеФорматированныйДокумент = Неопределено;
		
	Иначе
		
		ПодписьПриОтветеПересылкеПростойТекст = ПриОтветеПересылкеФорматированныйДокумент.ПолучитьТекст();
		
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ВключатьПодписьДляНовыхСообщений", ВключатьПодписьДляНовыхСообщений);
	СтруктураНастройки.Вставить("ВключатьПодписьПриОтветеПересылке", ВключатьПодписьПриОтветеПересылке);
	СтруктураНастройки.Вставить("ВсегдаЗапрашиватьУведомлениеОПрочтении", ВсегдаЗапрашиватьУведомлениеОПрочтении);
	СтруктураНастройки.Вставить("ВсегдаЗапрашиватьУведомленияОДоставке", ВсегдаЗапрашиватьУведомленияОДоставке);
	СтруктураНастройки.Вставить("НовоеСообщениеФорматированныйДокумент", НовоеСообщениеФорматированныйДокумент);
	СтруктураНастройки.Вставить("ПодписьДляНовыхСообщенийПростойТекст", ПодписьДляНовыхСообщенийПростойТекст);
	СтруктураНастройки.Вставить("ПодписьПриОтветеПересылкеПростойТекст", ПодписьПриОтветеПересылкеПростойТекст);
	СтруктураНастройки.Вставить("ПорядокОтветовНаЗапросыУведомленийОПрочтении", ПорядокОтветовНаЗапросыУведомленийОПрочтении);
	СтруктураНастройки.Вставить("ПриОтветеПересылкеФорматированныйДокумент", ПриОтветеПересылкеФорматированныйДокумент);
	СтруктураНастройки.Вставить("ФорматПодписиДляНовыхСообщений", ФорматПодписиДляНовыхСообщений);
	СтруктураНастройки.Вставить("ФорматПодписиПриОтветеПересылке", ФорматПодписиПриОтветеПересылке);
	СтруктураНастройки.Вставить("ОтображатьТелоИсходногоПисьма", ОтображатьТелоИсходногоПисьма);
	СтруктураНастройки.Вставить("ВключатьТелоИсходногоПисьма", ВключатьТелоИсходногоПисьма);
	СтруктураНастройки.Вставить("ОтправлятьСообщенияСразу", ОтправлятьСообщенияСразу);

	Взаимодействия.СохранитьНастройкуРаботаСПочтой(СтруктураНастройки);

КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииФорматаПриЗакрытии(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.КонтекстВызова = "ДляНовыхСообщений" Тогда
			ФорматПодписиДляНовыхСообщений = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML");
		ИначеЕсли ДополнительныеПараметры.КонтекстВызова = "ПриОтветеПересылке" Тогда
			ФорматПодписиПриОтветеПересылке = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML");
		КонецЕсли;
		ФорматПодписиДляНовыхСообщений = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML");
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.КонтекстВызова = "ДляНовыхСообщений" Тогда
		
		ПодписьДляНовыхСообщенийПростойТекст = НовоеСообщениеФорматированныйДокумент.ПолучитьТекст();
		НовоеСообщениеФорматированныйДокумент.Удалить();
		
	ИначеЕсли ДополнительныеПараметры.КонтекстВызова = "ПриОтветеПересылке" Тогда
		
		ПодписьПриОтветеПересылкеПростойТекст = ПриОтветеПересылкеФорматированныйДокумент.ПолучитьТекст();
		ПриОтветеПересылкеФорматированныйДокумент.Удалить();
	
	КонецЕсли;
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
